# Диалоговое окно для работы с материалами
# -> Нужен инструмент, чтобы можно было удобно добавлять новые ресурсы/материалы в несортированное
# -> Сортировать материалы и формировать roadmap
# -> Упорядочить материалы
# -> Добавить результат/отзыв
-> Сгенерировать расписание по доступным слотам времени

# Генерация плана и индекса
# -> Сгенерировать roadmap и текущее положение
Сгенерировать индексы материалов

Статистика
Сколько материалов осталось
Статистика по потраченному времени

Ручки
Что учить следующим

